# Programming languages and development tools
brew "python" # Latest version of Python
# Productivity tools
cask "raycast" # Workflows and shortcuts; supercharged OSX spotlight replacement
cask "obsidian" # Notetaking and mind-mapping
cask "rectangle" # Window management, spiritual successor to Spectacle
cask "bitwarden" # Open source password manager
cask "cleanshot" # CleanShot X - tidiest screenshot tool on the market
cask "zotero" # Reference management software
cask "keyboard-maestro" # Powerful Mac automation software
cask "calibre" # E-book management
cask "chatgpt" # Desktop app for ChatGPT
cask "betterdisplay" # Display management and window control
# File management
cask "google-drive" # Google's cloud storage service
cask "onedrive" # Microsoft's cloud storage service
cask "the-unarchiver" # Decompress RAR files etc
# Communication and collaboration
cask "whatsapp" # Messaging app
cask "signal" # Secure messaging app
cask "zoom" # Video conferencing
cask "claude" # Claude AI assistant
# Media
cask "vlc" # Open source media player
cask "macwhisper" # Audio transcription tool
cask "clop" # Clipboard manager
# Development and design
cask "hyper" # Terminal (iterm is probably better, just used to this one)
cask "figma" # UI/UX design tool
cask "rightfont" # Font management tool
cask "adobe-creative-cloud" # Suite of creative tools
# Browsers
cask "google-chrome" # Web browser
cask "orion" # Webkit-based browser with unique features
# System utilities
cask "karabiner-elements" # Keyboard customization
cask "logitech-options-plus" # Logitech device manager
cask "lulu" # Network firewall
cask "nordvpn" # Don't surf without one baby
cask "knockknock" # Security tool to detect persistent software
